princeton/ipvs/results/timeseries/time-scales/1_X_max/single-backend/500ms-fluctuation/3mins-run/5ms-feedback/wlc/1111-seed/run/httperf_client_123.log
httperf --verbose --hog --timeout=50 --client=0/1 --server=172.16.116.116 --port=8080 --uri=/ --rate=8 --send-buffer=4096 --recv-buffer=16384 --num-conns=1440 --num-calls=1
httperf: maximum number of open descriptors = 65535
Maximum connect burst length: 1

Connection lifetime histogram (time in ms):
             :
            10.5 98
            11.5 413
            12.5 201
            13.5 133
            14.5 73
            15.5 87
            16.5 183
            17.5 100
            18.5 73
            19.5 33
            20.5 12
            21.5 8
            22.5 3
            23.5 3
            24.5 3
            25.5 1
            26.5 1
             :
            32.5 1
             :
            60.5 1
             :
            81.5 1
             :
            89.5 1
             :
            91.5 1
             :
            93.5 1
             :
           183.5 1
             :
           221.5 1
             :
           230.5 1
             :
           248.5 1
             :
           250.5 1
             :
           270.5 1
             :
           331.5 1
             :
           370.5 1
             :
           380.5 1

Total: connections 1440 requests 1440 replies 1440 test-duration 179.899 s

Connection rate: 8.0 conn/s (124.9 ms/conn, <=2 concurrent connections)
Connection time [ms]: min 10.3 avg 15.9 max 380.7 median 13.5 stddev 21.9
Connection time [ms]: connect 0.8
Connection length [replies/conn]: 1.000

Request rate: 8.0 req/s (124.9 ms/req)
Request size [B]: 67.0

Reply rate [replies/s]: min 7.0 avg 8.0 max 9.0 stddev 0.1 (179 samples)
Percentages of the replies served at a given rate:
   50%: 7
   66%: 7
   75%: 7
   80%: 7
   90%: 7
   95%: 7
   98%: 7
   99%: 7
  100%: 9

Reply time [ms]: response 14.4 transfer 0.5
Percentages of the requests served within a certain time (ms) :
   50%: 11
   66%: 14
   75%: 15
   80%: 15
   90%: 16
   95%: 17
   98%: 19
   99%: 27
  100%: 369

Reply size [B]: header 163.0 content 72.0 footer 2.0 (total 237.0)
Reply status: 1xx=0 2xx=1440 3xx=0 4xx=0 5xx=0

CPU time [s]: user 147.60 system 32.00 (user 82.0% system 17.8% total 99.8%)
Net I/O: 2.4 KB/s (0.0*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0